AUTO_config_TK_pesok/src/Catalogs/ХарактеристикиНоменклатуры/ХарактеристикиНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ХарактеристикиНоменклатуры</name>
  <comment>Используется для ведения учета ТМЦ в дополнительных разрезах свойств, поставок, серий, серийных номеров и т.д.</comment>
  <owners>Catalog.Номенклатура</owners>
  <attributes>
    <name>Сортировка</name>
    <comment>Сортировка</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>20</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НеАктивная</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗначениеМРЦ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УКТВЭД</name>
    <type>
      <types>CatalogRef.КлассификаторУКТВЭД</types>
    </type>
  </attributes>
</mdclass:Catalog>

AUTO_config_TK_pesok/src/Catalogs/ХарактеристикиНоменклатуры/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
	Функция ВернутьХарактеристикуПоЗначениюМРЦ(Номенклатура,ЗначениеМРЦ,СоздаватьМРЦ=Ложь,ИсключитьУдаленные=Ложь)Экспорт
		
		Если ЗначениеМРЦ = 0 Тогда
			Возврат Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка();
		КонецЕсли;
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ХарактеристикиНоменклатуры.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ХарактеристикиНоменклатуры КАК ХарактеристикиНоменклатуры
		|ГДЕ
		|	ХарактеристикиНоменклатуры.Владелец = &Владелец
		|	И ХарактеристикиНоменклатуры.ЗначениеМРЦ = &ЗначениеМРЦ";
		
		Если ИсключитьУдаленные Тогда
			Запрос.Текст = Запрос.Текст + Символы.ПС + "	И НЕ ХарактеристикиНоменклатуры.ПометкаУдаления";
		КонецЕсли;
		
		Запрос.УстановитьПараметр("Владелец", Номенклатура);
		Запрос.УстановитьПараметр("ЗначениеМРЦ", ЗначениеМРЦ);
		
		РезультатЗапроса = Запрос.Выполнить();
		Если РезультатЗапроса.Пустой() Тогда
			Если СоздаватьМРЦ Тогда
				Результат = ТК_ОбменCentr.ОтправитьЗапросНаСозданиеМРЦ(Номенклатура,ЗначениеМРЦ,Неопределено);
				Если Результат.Успешно Тогда 					
					Характеристика = Результат.Характеристика;
				Иначе
					Характеристика = Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка();
				КонецЕсли;
				Возврат  Характеристика
			Иначе
				Возврат Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка();
			КонецЕсли;
		КонецЕсли;
		
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		ВыборкаДетальныеЗаписи.Следующий();
		
		Возврат ВыборкаДетальныеЗаписи.Ссылка;
		
	КонецФункции
	
	Функция ВернутьПоследнееАктивноеМРЦ(Номенклатура)Экспорт
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ХарактеристикиНоменклатуры.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ХарактеристикиНоменклатуры КАК ХарактеристикиНоменклатуры
		|ГДЕ
		|	ХарактеристикиНоменклатуры.Владелец = &Владелец
		|	И ХарактеристикиНоменклатуры.НеАктивная = ЛОЖЬ
		|	И ХарактеристикиНоменклатуры.ПометкаУдаления = ЛОЖЬ
		|
		|УПОРЯДОЧИТЬ ПО
		|	ХарактеристикиНоменклатуры.Сортировка УБЫВ";
		
		Запрос.УстановитьПараметр("Владелец", Номенклатура);
		
		РезультатЗапроса = Запрос.Выполнить();
		Если РезультатЗапроса.Пустой() Тогда 
			Возврат Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка();
		КонецЕсли;
		
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		ВыборкаДетальныеЗаписи.Следующий();
		
		Возврат ВыборкаДетальныеЗаписи.Ссылка;
		
	КонецФункции
	
	
	Функция ЗначениеМРЦ(Характеристика)Экспорт
		
		Если ЗначениеЗаполнено(Характеристика) Тогда
			МРЦ = Характеристика.ЗначениеМРЦ;
		Иначе
			МРЦ = 0;
		КонецЕсли;
		
		Возврат МРЦ;
		
	КонецФункции
	
	
#КонецЕсли
